Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: སབ་ཀང་རི་ལ་གནས་པའི་བྲམ་ཟེ་དང་ཁྱིམ་བདག་རྣམས་ཀྱིས་དེ་ལ་བཀུར་སྟི་བྱས་བླ་མར་བྱས་རི་མོར་བྱས་མཆོད་པར་བྱས་ཏེ།
en: All the brahmin householders living on Mount Sabkang held him in high esteem, revered him, and honored and venerated him.

source: གོས་དང་ཟས་དང་མལ་ཆ་དང་སྟན་དང་ནད་གསོས་དང་སྨན་ཟོང་རྣམས་རྙེད་པར་གྱུར་ནས།
en: Having acquired provisions of clothing, food, bedding, a seat, and medicines for the sick,

source: དེས་དེར་དགེ་སློང་འོངས་སོ་ཅོག་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱེད་དོ། །
en: he provided for all the needs of every monk who came there.

source: དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལྗོངས་རྒྱུ་ཞིང་དོང་བ་ལས་སབ་ཀང་རི་ལ་ཕྱིན་ཏེ། འཇིགས་བྱེད་མའི་ཚལ་རི་དགས་ཀྱི་ནགས་ན་གནས་སོ། །
en: At that time Śāriputra and Maudgalyāyana were traveling through the region and arrived at Mount Sabkang, where they stayed in the deer park in The Terrifying Forest.

source: དེ་ནས་དགེ་སློང་ཀོ་ཀ་ལི་ཀས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལྗོངས་རྒྱུ་ཞིང་སོང་སོང་བ་ལས་སབ་ཀང་རི་ལ་ཕྱིན་ཏེ། འཇིགས་བྱེད་མའི་ཚལ་རི་དགས་ཀྱི་ནགས་ན་འདུག་གོ་ཞེས་ཐོས་སོ། །
en: The monk Kokālika heard that Venerable Śāriputra and Maudgalyāyana were traveling through the region and had arrived at Mount Sabkang, where they were staying in the deer park in The Terrifying Forest.

source: ཐོས་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: When he heard this he went to see Śāriputra and Maudgalyāyana.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཀྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: Upon his arrival he touched his head to Venerable Śāriputra and Maudgalyāyana’s feet and took a seat at one side.

source: ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དགེ་སློང་ཀོ་ཀ་ལི་ཀས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Once he had taken a seat on the side, the monk Kokālika told Venerable Śāriputra and Maudgalyāyana,

source: བདག་གིས་བཙུན་པ་ཁྱེད་གཉིས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བགྱིས། ཁྱེད་གཉིས་ཀྱིས་ཐུགས་ཁྲལ་ཆུང་ངུར་བཞུགས་ཤིག །
en: “Lords, I shall provide for all your needs. Don’t be concerned.”

source: དེ་གཉིས་ཀྱིས་སྨྲས་པ་ཚེ་དང་ལྡན་པ་སབ་ཀང་རི་འདི་ནི་ཤིན་ཏུ་འཇིགས་པ་ཡིན་ཏེ་འདིར་གནས་མི་ཕོད་ཀྱིས།
en: “Venerable one,” they said, “This area of Mount Sabkang is so eerie that we can’t bear to stay here.

source: བདག་ཅག་གཉིས་ནི་དགོན་པ་རབ་ཏུ་དབེན་པའི་གནས་ག་གེ་མོ་ཞིག་ཏུ་སོང་སྟེ་གནས་པར་བྱའོ། །
en: We’re going to stay at such-and-such a place, a very remote and secluded part of the mountain.”

source: ཀོ་ཀ་ལི་ཀས་སྨྲས་པ། དེར་བཞུད་ན་ཡང་བདག་གིས་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བགྱིས།
en: “If you do go there,” Kokālika said, “I would still like to come and provide for all your needs.

source: ཁྱེད་གཉིས་ཀྱིས་བདག་ལ་གནང་བར་མཛོད་ཅིག །
en: Please permit me to do so.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུས་སྨྲས་པ།
en: Venerable Śāriputra and Maudgalyāyana replied,

source: གལ་ཏེ་ཁྱོད་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་དགོན་པའི་གནས་ག་གེ་མོ་ཞིག་ན་འདུག་གོ་ཞེས་སབ་ཀང་རི་འདིར་སུ་ལ་ཡང་མི་ཟེར་ན་ནི་བདག་ཅག་གཉིས་འདུག་པར་བྱའོ། །
en: “If you don’t tell anyone that Śāriputra and Maudgalyāyana are both staying on Mount Sabkang in the hermitage at such-and-such a place, then we will stay there.

source: གལ་ཏེ་ཁྱོད་ཀྱིས་འགའ་ཞིག་ལ་བྱས་ན་ནི་བདག་ཅག་གཉིས་ཀྱིས་ཁྱོད་ལ་མ་སྦྲན་པར་གནས་དེ་ནས་གུད་དུ་འགྲོའོ། །
en: If you do tell anyone, then we will go elsewhere without a word to you.”

source: ཀོ་ཀ་ལི་ཀས་སྨྲས་པ། སུ་ལ་ཡང་མི་མཆིས་གནང་བར་མཛོད་ཅིག །
en: “I won’t tell anyone. Please, permit me,” Kokālika said.

source: དེ་ནས་དེ་གཉིས་དེ་ལ་ཅང་མི་སྨྲ་བས་ཁས་བླངས་སོ། །
en: They assented by their silence

source: དེ་གཉིས་ཀྱིས་དེ་ལ་ཁས་བླངས་ནས་དགོན་པའི་གནས་དེར་སོང་སྟེ།
en: and went to stay in the hermitage as they had agreed.

source: འཁོད་ནས་ཀོ་ཀ་ལི་ཀས་དེ་གཉིས་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱེད་པ་ལ་ཞུགས་སོ། །
en: As they settled in, Kokālika provided for all their needs.

source: དེ་ནས་དེའི་ཚེ་སབ་ཀང་རི་དེ་ཉིད་ན་ཁྱིམ་བདག་ཅིག་གནས་ཏེ། ཁྱིམ་བདག་དེ་དགེ་སློང་ཀོ་ཀ་ལི་ཀ་ལ་མངོན་པར་དགའ་བར་གྱུར་ནས། དེ་དེ་ལ་ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱེད་དོ། །
en: At that time a certain householder lived on Mount Sabkang who deeply admired the monk Kokālika and provided for all his needs.

source: དེ་ནས་ཕྱི་ཞིག་ན་ཁྱིམ་བདག་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: One day his wife conceived,

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ། དགེ་སློང་ཀོ་ཀ་ལི་ཀ་དེ་ཉིད་ལས་བརྟེན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་དེ། སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ། །
en: When he had grown, he entrusted himself to Venerable Kokālika, found faith in the doctrine of the Blessed One, went for refuge, and took the fundamental precepts.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་བློ་སྐྱེས་པ། བདག་ཁྱིམ་ན་གནས་པ་བཏང་ལ་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ངོ་སྙམ་སྟེ།
en: One day he thought, “I will give up living at home to go forth in the doctrine of the Blessed One.”

source: ཚེ་དང་ལྡན་པ་ཀོ་ཀ་ལི་ཀ་ག་ལ་བ་དེར་སོང་ནས་སྨྲས་པ།
en: He went to see Venerable Kokālika and said to him,

source: བཙུན་པ་ཀོ་ཀ་ལི་ཀ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན
en: “Lord Kokālika, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: ཀོ་ཀ་ལི་ཀས་སྨྲས་པ། གཞོན་ནུ་ཁྱོད་ཕ་མ་གཉིས་ཀྱིས་གནང་ངམ།
en: “Young man, have your parents consented?” asked Kokālika.

source: དེས་སྨྲས་པ་མ་གནང་ངོ་། །
en: “No, they have not,” he replied.

source: ཀོ་ཀ་ལི་ཀས་སྨྲས་པ། བུ་སངས་རྒྱས་རྣམས་དང་སངས་རྒྱས་ཀྱི་ཉན་ཐོས་རྣམས་ནི། ཕ་མ་གཉིས་ཀྱིས་མ་གནང་བར་རབ་ཏུ་འབྱིན་པར་ཡང་མི་མཛད། བསྙེན་པར་རྫོགས་པར་ཡང་མི་མཛད་ཀྱིས།
en: “Young man, the buddhas and their disciples neither lead novices to go forth nor confer full ordination on young persons without their parents’ permission,” the monk told him.

source: སོང་ལ་ཕ་མ་གཉིས་ལ་གསོལ་ཅིག་དང་དེའི་འོག་ཏུ་ཁྱོད་ཀྱི་སླ་བར་འགྱུར་རོ། །
en: “Go and ask your parents, then come back here. This will make things easier for you later on.”

source: དེ་ནས་འཕགས་པ་ཇི་ལྟར་དགྱེས་པ་དེ་བཞིན་དུ་འཚལ་ལོ་ཞེས་བྱས་ནས།
en: He said, “As you wish, noble one.”

source: དེ་ཕ་མའི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: Then he approached his parents and requested,

source: ཡབ་ཡུམ་བདག་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་རབ་ཏུ་འབྱུང་བར་གནང་བར་མཛད་དུ་གསོལ་ཕ་མ་གཉིས་ཀྱིས་སྨྲས་པ། བདག་ཅག་ནི་ཁྱོད་ཤི་སྟེ་
en: “Mother, Father, I am asking for your kind permission to go forth in the doctrine of the Blessed One.” His parents replied,

source: འབྲལ་བར་འགྱུར་ཡང་སྲིད་ཀྱི། ཁྱོད་གསོན་བཞིན་དུ་གནང་བར་ནི་མི་བྱེད་དོ། །
en: “Though death will separate us from you, for as long as we yet live we cannot permit this.”

source: དེ་ནས་ཕྱི་ཞིག་ན་ཚེ་དང་ལྡན་པ་ཀོ་ཀ་ལི་ཀ་ལྗོངས་དག་ཏུ་དོན་བསྒྲུབ་པ་ཞིག་བྱུང་ནས།
en: One day, it so happened that Venerable Kokālika had to go down into the townships on an errand.

source: དེས་ལྷན་ཅིག་གནས་པ་དང་ཉེ་གནས་རྣམས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ལ་གཏད་དེ།
en: He presented his students and disciples to Venerable Śāriputra and Maudgalyāyana, saying,

source: བཙུན་པ་གཉིས་བདག་ནི་ལྗོངས་དག་ཏུ་བགྱི་བ་ཅུང་ཟད་ཅིག་ལ་མཆིས།
en: “Lords, I have to travel through the townships for a little while.

source: དགེ་སློང་འདི་དག་བཙུན་པ་གཉིས་ཀྱིས་ལུང་དབོག་པ་དང་ཡིད་ལ་བགྱིད་པའི་ལུང་དང་ཞུ་བའི་གནས་སྩལ་དུ་གསོལ་ཞེས་བྱས་ནས།
en: Lords, please confer upon these monks instruction, advice to ponder, and a topic for further inquiry.”

source: དེས་དེ་གཉིས་ལ་འཁོར་རྣམས་གཏད་དེ་ལྗོངས་རྒྱུ་ཞིང་སོང་ངོ་། །
en: Having thus presented the group to them, he began to travel through the townships.

source: དེ་སོང་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཀྱིས་བསམས་པ།
en: When he had gone, Venerable Śāriputra and Maudgalyāyana wondered,

source: དགེ་སློང་འདི་དག་ལ་ངེས་པར་འབྱེད་པའི་ཆ་བཞིའི་དགེ་བ་ཅུང་ཟད་ཡོད་དམ་མེད་ཅིག་གུ་སྙམ་སྟེ
en: “Do these monks have some small measure of the virtues that are conducive to the four stages of penetrative insight?”

source: དེ་གཉིས་ཀྱིས་བལྟས་ནས་ཡོད་པར་གྱུར་ཏེ། བདག་ཅག་གཉིས་ཁོ་ན་ལ་རག་ལས་པར་མཐོང་ནས།
en: They looked out and saw that they did, but that it depended solely on the two of them.

source: དགེ་སློང་དེ་དག་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་ནི་རྫུ་འཕྲུལ་གྱི་ཆོ་འཕྲུལ་གྱིས་བསྐུལ།
en: So Venerable Maudgalyāyana inspired the monks with a miracle of magical abilities

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ནི་རྗེས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་གྱིས་བསྐུལ་ནས།
en: and Venerable Śāriputra inspired them with a miracle of admonition.

source: དེ་དག་གིས་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: Casting away all afflictive emotions through diligence, practice, and effort, they manifested arhatship.

source: དེ་དག་གིས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་ཁྱིམ་བདག་གི་བུ་དེས་ཀྱང་ཕ་མ་ལ་གསོལ་ཏེ།
en: After they achieved arhatship, the householder’s son again asked for his parents’ permission,

source: གཙུག་ལག་ཁང་དུ་སོང་ནས་དེ་དགེ་སློང་དེ་དག་གི་ཐད་དུ་སོང་སྟེ་སྨྲས་པ།
en: returned to the monastery, approached the monks, and asked them,

source: བཙུན་པ་ཀོ་ཀ་ལི་ཀ་གར་མཆིས།
en: “Where is Lord Kokālika?”

source: དེ་དག་གིས་སྨྲས་པ། དེ་ཅི་ལ་དགོས།
en: “What do you need him for?” they asked.

source: ཁྱེའུས་སྨྲས་པ། བདག་དེ་ལས་རབ་ཏུ་འབྱུང་བར་འཚལ་ལོ། །
en: “I would like him to lead me to go forth,” said the young man.

source: དགེ་སློང་དེ་དག་གིས་དེ་ལ་སྨྲས་པ། ཁྱོད་ལ་ཀོ་ཀ་ལི་ཀ་ཅི་དགོས།
en: “Why do you need Kokālika?” the monks asked him.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་འདི་གཉིས་ནི་མཆོག་གི་ཟུང་། ཟུང་བཟང་པོ་ཡིན་གྱིས་དེ་གཉིས་ལས་རབ་ཏུ་འབྱུང་བར་གྱིས་ཤིག་ཅེས་བྱས་སོ། །
en: “Venerable Śāriputra and Maudgalyāyana are a supreme and excellent pair. You should go forth with them.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་ཁྱེའུ་དེ་དགའ་ཆེས་ནས།
en: The young man was thrilled to hear this.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ག་ལ་བ་དེར་སོང་སྟེ་
en: He went to see Venerable Śāriputra and Maudgalyāyana,

source: ཕྱིན་ནས། དེ་གཉིས་ཀྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: and upon his arrival he touched his head to their feet

source: ཆོས་མཉན་པའི་ཕྱིར་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་མདུན་དུ་འདུག་གོ། །
en: and sat before Venerable Śāriputra to listen to the Dharma.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཀྱང་དེའི་བསམ་པ་དང་བག་ལ་ཉལ་དང་ཁམས་དང་ཤེས་པ་དང་རང་བཞིན་རྟོགས་ནས་དེ་དང་འཐུན་པའི་ཆོས་བསྟན་ཏེ།
en: Venerable Śāriputra directly apprehended his thoughts, habitual tendencies, temperament, capacity, and nature, and taught him the Dharma accordingly.

source: དེས་ན་ཁྱེའུ་དེ་སྟན་དེ་ཉིད་ལ་འདུག་བཞིན་དུ་འཇིག་ཚོགས་ལ་ལྟ་བའི་རིའི་རྩེ་མོ་མཐོན་པོ་ཉི་ཤུ་ཡེ་ཤེས་རྡོ་རྗེས་བཅོམ་ནས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་ཏེ
en: When he heard it, the young man destroyed with the thunderbolt of wisdom the twenty high peaks of the mountain of views concerning the transitory collection, and manifested the resultant state of stream entry right where he sat.

source: དེས་བདེན་པ་མཐོང་ནས་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Having seen the truths, he rose from his seat, drew down the right shoulder of his upper garment, bowed toward Venerable Śāriputra with palms pressed together, and implored Venerable Śāriputra,

source: བཙུན་པ་ཤཱ་རིའི་བུ་བདག་ལེགས་པར་གསུངས་པའི་ཆོས་འདུལ་བ་ལ་རབ་ཏུ་འབྱུང་བ་དང་བསྙེན་པར་རྫོགས་ཤིང་དགེ་སློང་གི་དངོས་པོ་འཐོབ་ཏུ་རུང་ན།
en: “Lord, if permitted I wish to go forth in the Dharma and Vinaya so well spoken, complete my novitiate, and achieve full ordination.

source: བདག་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་པར་འཚལ་ལོ་ཞེས་བྱས་ནས།
en: In the presence of the Blessed One, I too wish to practice the holy life.”

source: བཙུན་པ་ཤཱ་རིའི་བུས་སྨྲས་པ། བུ་ཁྱོད་ལ་ཕ་མ་གཉིས་ཀྱིས་གནང་ངམ།
en: “Young man, have your parents consented?” Śāriputra asked.

source: དེས་སྨྲས་པ། བཙུན་པ་ཤཱ་རིའི་བུ་བདག་ནི་གནང་ལགས་སོ། །
en: The young man replied, “Yes, Lord Śāriputra, they have.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་ཁྱེའུ་དེ་རབ་ཏུ་ཕྱུང་སྟེ་བསྙེན་པར་རྫོགས་པར་བྱས་ནས་དེ་ལ་ལུང་ཡང་ཕོག་གོ། །
en: Thereupon Venerable Śāriputra led him to go forth as a novice and conferred on him full ordination and instructed him.

source: དེས་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་ཕ་མ་གཉིས་བདེན་པ་རྣམས་ལ་བཀོད་དོ། །
en: Having achieved arhatship, he established his parents in the truths,

source: སྦྱིན་པ་དང་སྦྱིན་པའི་བགོ་བཤའ་ལ་ཡང་བཙུད་དོ། །
en: and he inspired them to give gifts and to share what they had.

source: དེ་ནས་ཕྱི་ཞིག་ན་ལྷ་རྣམས་ཀྱིས་སབ་ཀང་རི་ལ་སྒྲ་བསྒྲགས་ཏེ།
en: Then one day on Mount Sabkang the gods announced,

source: ཀྱེ་ཁྱེད་ཀྱི་གྲོང་འདབ་ན་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་འཁོད་བཞིན་དུ་ཁྱོད་བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་དེ་གཉིས་ཀྱི་ཐད་དུ་མ་དོང་ན། ཁྱེད་ཀྱིས་ཅི་རྙེད་ཅི་ཞིག་ནི་ལེགས་པར་རྙེད་ཅེས་བྱས་སོ། །
en: “Pay heed! The monks Śāriputra and Maudgalyāyana are living near your village. If you do not go see them to offer your respectful service, what can you hope for? What good will come of you?”

source: དེ་ནས་སབ་ཀང་རི་ལ་གནས་པའི་སྐྱེ་བོ་མང་པོ་རྣམས་ཀྱི་སྒྲ་ཐོས་ནས་སྡེ་ཚན་ནས་སྡེ་ཚན་དང་། ཕ་ཚན་ནས་ཕ་ཚན་དང་། དགའ་སྡེ་ནས་དགའ་སྡེར་འདུས་ཤིང་ཚོགས་ཏེ་སབ་ཀང་རི་ལས་བྱུང་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ག་ལ་བ་དེར་སོང་སྟེ་
en: Hearing this, many of the people living on Mount Sabkang gathered—group after group, elder after elder, one joyful group after another—and convened upon Mount Sabkang to see Venerable Śāriputra and Maudgalyāyana.

source: ལྷགས་ནས་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ་བཀུར་སྟི་བྱེད་པ་ལ་ཞུགས་སོ། །
en: As they arrived they began touching their heads to their feet and offering their respect.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཀྱིས་བསམས་པ།
en: Venerable Śāriputra and Maudgalyāyana thought,

source: བདག་ཅག་གཉིས་ཀྱི་རྙེད་པ་དང་བཀུར་སྟི་བྱུང་གིས་གཅད་དགོས་སོ། །
en: “We have to put a stop to all this worldly profit and acclaim.

source: བདག་ཅག་གཉིས་ཀྱིས་ཀྱང་ཀོ་ཀ་ལི་ཀ་ལ་དམ་བཅས་ཏེ།
en: We already made an agreement with Kokālika, saying,

source: གལ་ཏེ་ཁྱོད་ཀྱིས་བདག་ཅག་གཉིས་དགོན་པ་འདི་ན་གནས་སོ་ཞེས་སུ་ལ་ཡང་མ་བསྙད་ན་ནི་བདག་ཅག་གཉིས་དགོན་པའི་གནས་འདིར་གནས་པར་བྱའོ། །
en: ‘If you don’t tell anyone that Śāriputra and Maudgalyāyana are both staying in the hermitage at such-and-such a place, we will stay here in the hermitage.

source: དེ་སྟེ་བདག་ཅག་གཉིས་ཀྱི་རྙེད་པ་དང་བཀུར་སྟི་ཞིག་བྱུང་བར་གྱུར་ན་ནི། བདག་ཅག་གཉིས་ཀྱིས་ཁྱོད་ལ་ཡང་མ་སྦྲན་པར་དགོན་པའི་གནས་འདི་ནས་འགྲོའོ་ཞེས་བྱས་ཟིན་ནོ་སྙམ་ནས་
en: But if people come trying to help and offering their respect, we’ll both leave this place without a word to you.’ ”

source: དགོན་པའི་གནས་དེ་ནས་དོང་ངོ་། །
en: And so they departed.

source: ཀོ་ཀ་ལི་ཀའི་སློབ་མ་དང་། ཉེ་གནས་དེ་དག་གིས་སྨྲས་པ།
en: Kokālika’s students and disciples said,

source: བདག་ཅག་ཀྱང་སློབ་དཔོན་གཉིས་དང་ཐབས་ཅིག་ཏུ་མཆིའོ། །
en: “We will accompany our two preceptors.”

source: ཤཱ་རིའི་བུས་སྨྲས་པ། ཁྱེད་ནི་རྒྱལ་པོའི་ཁབ་ཏུ་དེང་ཤིག་ཁོ་བོ་ཅག་གཉིས་ནི་ལོགས་ཤིག་ནས་འདུལ་བར་བྱ་བའི་དོན་བྱེད་ཅིང་འགྲོ་དགོས་ལ།
en: “You all must go to Rājagṛha,” Śāriputra replied. “We need to go elsewhere and act for the benefit of those to be tamed.

source: ཐམས་ཅད་དེར་དོང་ན་ཟས་ཀྱིས་ཀྱང་བྲེལ་བར་གྱུར་ན་མི་རུང་ངོ་ཞེས་བྱས་སོ། །
en: If we all travel there together, there will not be enough food, and that would be improper.”

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དགེ་སློང་དེ་དག་ལམ་གུད་ནས་རྒྱལ་པོའི་ཁབ་ཏུ་དོང་སྟེ་འཁོད་དོ། །
en: As soon as the monks heard this, they set out for Rājagṛha via another path and settled in there,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ནི་ལམ་གཞན་ཞིག་ཏུ་ཞུགས་ཏེ་དེ་གཉིས་ཆས་པ་ན་ཆར་པ་ཁད་ཀྱིས་དལ་ནས་དལ་ནས་བབ་བོ། །
en: while Venerable Śāriputra and Maudgalyāyana set out upon a different path, where slowly rain began to fall.

source: རི་འགབ་དེ་ན་རིའི་ཕུག་ཅིག་ཡོད་དེདེར་མ་ཧེ་རྫི་མོ་ཞིག་སྔར་ནང་དུ་སོང་བ་ལས་དེ་མི་གཉིས་ཀྱིས་ཉལ་པོ་བྱས་ནས།
en: At the foot of those mountains there was a mountain cave, and in that cave there was a buffalo herder woman who had recently gone there and slept with two different men.

source: དེ་གཉིས་དེ་ནས་ཕྱིར་སོང་བའི་འོག་ཏུ་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་དེར་འོངས་ནས་ཕུག་སྒོ་ན་འཁོད་དོ། །
en: The monks Śāriputra and Maudgalyāyana arrived after those two had left and sat down at the mouth of the cave.

source: དེ་ནས་དེ་དག་དགོན་པའི་གནས་དེ་ནས་དོང་བའི་འོག་ཏུ། དགེ་སློང་ཀོ་ཀ་ལི་ཀ་ཡང་རང་གི་གཙུག་ལག་ཁང་དེར་འོངས་ཏེ།
en: The monk Kokālika returned to his monastery after those two had left,

source: དེ་དེར་འོངས་ན་སློབ་མ་དང་ཉེ་གནས་རྣམས་མི་སྣང་ནས་དེས་དགེ་སློང་གཞན་དག་ལ་དྲིས་པ།
en: and when he arrived he found his students and disciples had all disappeared. He asked the other monks,

source: བདག་གི་སློབ་མ་དང་ཉེ་གནས་དེ་དག་གར་དོང་།
en: “Where did all my students and disciples go?”

source: དེ་དག་གིས་སྨྲས་པ། དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་དང་ལྷན་ཅིག་ཏུ་དོང་ངོ་། །
en: “They left with the monks Śāriputra and Maudgalyāyana,” they replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ། དགེ་སློང་ཀོ་ཀ་ལི་ཀ་ཤས་ཆེར་ཁྲོས་ཏེ།
en: No sooner did the monk Kokālika hear this than he was seething with anger.

source: དེ་གཉིས་ཀྱིས་བདག་ལ་མ་བཟླུགས་པར་སོང་བའི་སྟེང་དུ་བདག་གི་འཁོར་རྣམས་ཀྱང་ཁ་དྲངས་ཏེ་སོང་ངོ་ཞེས་ཟེར་རོ། །
en: “Not only did those two leave without informing me, they also took my followers with them!” he said.

source: དེ་དེ་ན་འདུག་པ་ན་ཁྱིམ་བདག་དེ་ཡང་ཐད་དུ་འོངས་ནས་ཀོ་ཀ་ལི་ཀས་ཁྱིམ་བདག་དེ་ལ་དྲིས་པ།
en: While he was standing there the householder came to where he was. Kokālika asked the householder,

source: ཁྱིམ་བདག་ཁྱོད་ཀྱི་བུ་དེ་གར་སོང་།
en: “Householder, where did your child go?”

source: ཁྱིམ་བདག་གིས་སྨྲས་པ། རབ་ཏུ་བྱུང་ངོ་། །
en: “He has gone forth,” the householder replied.

source: སུའི་ཐད་དུ་རབ་ཏུ་བྱུང་།
en: “Who led him to go forth?”

source: ཁྱིམ་བདག་གིས་སྨྲས་པ། ཤཱ་རིའི་བུའི་ཐད་དུ་རབ་ཏུ་བྱུང་ངོ་། །
en: “He went forth in the presence of Śāriputra,” the householder replied.

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དེ་ལྷག་པར་ཡང་དེ་གཉིས་ལ་རབ་ཏུ་ཁྲོས་སོ། །
en: No sooner did Kokālika hear this than he became even more furious at the two of them.

source: གཞན་ཡང་སབ་ཀང་རི་ལ་གནས་པའི་བྲམ་ཟེ་རྣམས་ཀྱིས་སྙིང་ན་བའི་ཚིག་གིས་ཞེར་བཏབ་སྟེ།
en: The heartbreaking admonition from the brahmins living on Mount Sabkang had likewise cut him to the quick.

source: བཙུན་པ་ཀོ་ཀ་ལི་ཀ་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་འདིར་བྱོན་པ་ལྟ་ཞིག་ན་ཁྱོད་ཀྱིས་བདག་ཅག་ལ་མ་སྦྲན་ཏོ་ཞེས་བྱས་སོ། །
en: “Lord Kokālika,” the brahmins said, “the monks Śāriputra and Maudgalyāyana both came here, but you didn’t inform us.”

source: དེ་ནས་དེ་ཡུལ་ཡུལ་པོར་གྱུར་ནས་དེས་བསམས་པ།
en: At this he became very embarrassed and thought,

source: དེ་གཉིས་ཀྱིས་བདག་གི་འཁོར་ཁྲིད་དེ་སོང་མོད་ཀྱི།
en: “Those two may have gone and taken all my disciples,

source: བདག་གིས་ཀྱང་རང་གི་འཁོར་ཡལ་བར་གཏང་དུ་མི་རུང་གིས།
en: but I can’t let them get away so easily.

source: བདག་སོང་ལ་རང་གི་འཁོར་རྣམས་བཀུག་སྟེ་ཕྱིར་འོང་བར་བྱའོ་སྙམ་ནས
en: I will go there, muster my disciples, and return.”

source: ཤམ་ཐབས་བགོས་ཏེ་ལྷུང་བཟེད་ཐོགས་ནས། དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་གར་དོང་བའི་ལམ་དེ་ཉིད་དུ་ཆས་ནས་དེ་མཐར་གྱིས་ཕུག་དེ་ཁོ་ནའི་སྒོར་ཕྱིན་ཏེ།
en: So he donned his lower garment and Dharma robes, and, carrying his alms bowl, set out on by the path that the monks Śāriputra and Maudgalyāyana had traveled, until he eventually arrived at the mouth of that very same cave.

source: དགེ་སློང་ཀོ་ཀ་ལི་ཀས་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཕུག་སྒོ་དེ་ཉིད་ན་འཁོད་པ་མཐོང་ནས་དེ་དེ་གཉིས་ཀྱི་ཐད་དུ་སོང་སྟེ།
en: When he saw the monks Śāriputra and Maudgalyāyana sitting just inside the mouth of the cave,

source: རྐང་པ་ལ་ཕྱག་འཚལ་ནས་ཀུན་དགའ་བའི་གཏམ་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: he went to them, touched his head to their feet, made pleasant conversation, and took a seat at one side.

source: དེ་ནས་དེ་རྣམས་ཀྱི་སྐད་མ་ཧེ་རྫི་མོ་དེས་ཐོས་ནས་ཕུག་དེ་ནས་ཕྱིར་བྱུང་སྟེ་སོང་ངོ་། །
en: The buffalo herder woman heard their conversation, emerged from inside the cave, and departed.

source: དེ་ནས་དེ་ལ་ཀོ་ཀ་ལི་ཀ་ཁུ་ཕྲིག་ཟོས་ནས། ཚེ་དང་ལྡན་པ་དེ་ཡང་མཚན་བརྟགས་ལ་མཁས་པ་ཞིག་སྟེ།
en: Now Kokālika suspected there was semen on her, for those gone forth are discerning and can recognize signs.

source: དེས་བལྟས་ན་མ་ཧེ་རྫི་མོ་དེ་ལ་མི་གཉིས་ཀྱིས་ཉལ་པོ་བྱས་པར་རིག་གོ། །
en: When he looked, he knew that the buffalo herder woman had slept with two men.

source: དེ་ནས་དེ་མཐོང་མ་ཐག་ཏུ་དེ་ལ་འདི་ལྟ་བུའི་སྡིག་པའི་ལྟ་བའི་རྣམ་པ་སྐྱེས་ཏེ།
en: So when he saw her, the sinful thought occurred to him, “These two revel in sin!

source: འདི་གཉིས་ནི་སྡིག་པ་ལ་དགའ་བ་སྡིག་པའི་ཆོས་དང་ལྡན་པ་ཡིན་ནོ་ཞེས་ཚིག་རྩུབ་ཅིང་བརླང་བས་ཞེ་བཅད་ནས།
en: They are sinful!” He cursed them with crude, abusive language and left for Rājagṛha.

source: རྒྱལ་པོའི་ཁབ་ཏུ་སོང་སྟེ་འོད་མའི་ཚལ་དུ་ཞུགས་ནས་ལྷུང་བཟེད་དང་ཆོས་གོས་བཞག་སྟེ།
en: When he came to Bamboo Grove, he left behind his alms bowl and Dharma robes.

source: དགེ་སློང་མཐོང་ངོ་ཅོག་ལ་ཡང་དག་པ་མ་ཡིན་པའི་ཕྱར་ཀ་བཏང་སྟེ།
en: Unduly belittling them to every monk he saw, he exclaimed,

source: དེ་གཉིས་ནི་སྡིག་པ་ལ་དགའ་བ་སྡིག་པའི་ཆོས་དང་ལྡན་པ་ཡིན་ནོ་ཞེས་ཟེར་རོ། །
en: “Those two revel in sin!

source: དེ་ནས་སྐབས་དེ་དགེ་སློང་དག་གིས་ཐོས་ནས་བཅོམ་ལྡན་འདས་ལ་གསོལ་ཏོ། །
en: They are sinful!” When the monks heard about the situation, they informed the Blessed One,

source: དེ་ནས་དེར་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཀོ་ཀ་ལི་ཀ་ལ་བཀའ་སྩལ་པ།
en: and the Blessed One warned the monk Kokālika,

source: ཀོ་ཀ་ལི་ཀ་ཀོ་ཀ་ལི་ཀ་ཁྱོད་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཤིན་ཏུ་དེས་པ་བྱེ་བྲག་ཕྱེད་པ་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ལ་སེམས་དགའ་བར་གྱིས་ཤིག །
en: “Kokālika, Kokālika, may your mind be filled with joy toward these two gentle, considerate, celibate monks Śāriputra and Maudgalyāyana,

source: ཁྱོད་ཡུན་རིང་པོར་གནོད་པ་དང་མི་ཕན་པ་དང་སྡུག་བསྔལ་བར་གྱུར་ཏ་རེ།
en: or else for a long time harm will befall you, and you will not benefit, but suffer.”

source: བདག་ནི་བཅོམ་ལྡན་འདས་ལ་དད་ཅིང་གློ་བ་ཆེས་ཀྱིས་ཀྱང་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ནི་སྡིག་པ་ལ་དགའ་བ་སྡིག་པའི་སེམས་དང་ལྡན་པ་ལགས་སོ། །
en: “I have faith and trust in the Blessed One,” he replied, “but the monks Śāriputra and Maudgalyāyana revel in sin. Their minds are full of sin.”

source: དེ་བཞིན་དུ་ལན་གཉིས་ལན་གསུམ་གྱི་བར་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་ཀོ་ཀ་ལི་ཀ་ལ་བཀའ་སྩལ་པ།
en: The Blessed One warned the monk Kokālika a second and then a third time in the same way, saying,

source: ཀོ་ཀ་ལི་ཀ །ཀོ་ཀ་ལི་ཀ་ཁྱོད་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ཤིན་ཏུ་དེས་པ་བྱེ་བྲག་ཕྱེད་པ་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་ལ་སེམས་དགའ་བར་གྱིས་ཤིག །
en: “Kokālika, Kokālika, may your mind be filled with joy toward these two gentle, considerate, celibate monks, Śāriputra and Maudgalyāyana,

source: བདག་ནི་བཅོམ་ལྡན་འདས་ལ་དད་ཅིང་གློ་བ་ཆེས་ཀྱིས་ཀྱང་དགེ་སློང་ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ནི་སྡིག་པ་ལ་དགའ་བ་སྡིག་པའི་དབང་དུ་གྱུར་པ་ལགས་སོ། །
en: “I have faith and trust in the Blessed One,” he replied, “but the monks Śāriputra and Maudgalyāyana revel in sin. They have fallen under the sway of sin.”

source: དེ་ནས་དགེ་སློང་ཀོ་ཀ་ལི་ཀས་ལན་གཉིས་ལན་གསུམ་གྱི་བར་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ་ལྟར་མ་བྱས་ནས་
en: The monk Kokālika paid no heed to the Blessed One’s words the second or the third time.

source: སྟན་ལས་ལངས་ཏེ་སོང་ངོ་། །
en: Then he rose from his seat and departed.

source: དེ་ནས་སོང་མ་ཐག་ཏུ་དགེ་སློང་ཀོ་ཀ་ལི་ཀ་དེའི་ལུས་ཐམས་ཅད་འབྲས་ཡུངས་འབྲུ་ཙམ་ཤ་སྟག་གིས་གང་བར་གྱུར་ཏོ། །
en: No sooner had the monk Kokālika departed than, first, pimples the size of mustard seeds popped up all over his body.

source: དེ་ནས་དེའི་འོག་ཏུ་འབྲས་རྒྱ་སྲན་ཙམ་དང་རྒྱ་ཤུག་གི་འབྲུ་ཙམ་དང་སྐྱུ་རུ་ར་ཙམ་དང་བིལ་བའི་འབྲས་བུ་ཙམ་དང་ཀ་པིད་ཏའི་འབྲས་བུ་ཙམ་ཤ་སྟག་གིས་གང་བར་གྱུར་ཏོ། །
en: Soon after came pustules the size of beans—small beans, then large ones. After that they became even bigger—like mirabalam fruit, then like very big bilba fruit, then even the size of kapita fruit, until boils completely covered his body.

source: དེ་ནས་དགེ་སློང་ཀོ་ཀ་ལི་ཀའི་ཁ་ནས་ཁྲག་དྲོན་པོ་སྐྱུག་ཅིང་བདག་ནི་ཚིག་གོ་བདག་ནི་ཚིག་གོ་ཞེས་ཟེར་ཏེ་
en: Finally the monk Kokālika began to spew warm blood from his mouth and cried out, “I’m burning!

source: ལུས་ཐམས་ཅད་ནས་རྣག་ཁྲག་འཛག་ཅིང་འབབ་བཞིན་དུ་ལུས་དང་བྲལ་ཏེ
en: I’m burning!” as pus and blood began to seep and then pour out of his body, until he died.
